# running in formal/range_merger_bmc/src/
read_ilang ../../../generated/range_merger.il
prep -top top

hierarchy -simcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
