# running in formal/merge_sort_bmc/src/
read_ilang ../../../generated/merge_sort.il
prep -top top

hierarchy -simcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
